tutorials/incompressible/pimpleFoam/TJunctionFan/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          25;
        startFace       10050;
    }
    outlet1
    {
        type            patch;
        nFaces          25;
        startFace       10075;
    }
    outlet2
    {
        type            patch;
        nFaces          25;
        startFace       10100;
    }
    baffles
    {
        type            wall;
        nFaces          0;
        startFace       10125;
    }
    fan_half0
    {
        type            cyclic;
        nFaces          0;
        startFace       10125;
        matchTolerance  0.0001;
        neighbourPatch  fan_half1;
    }
    fan_half1
    {
        type            cyclic;
        nFaces          0;
        startFace       10125;
        matchTolerance  0.0001;
        neighbourPatch  fan_half0;
    }
    defaultFaces
    {
        type            wall;
        nFaces          3075;
        startFace       10125;
    }
)

// ************************************************************************* //
